Table of Contents
 Interface IIdeaCrossSectionByComponents
Namespace
IdeaStatiCa.BimApi
Assembly
IdeaStatiCa.BimApi.dll
A generic cross-sectíons defined by its components.
public interface IIdeaCrossSectionByComponents : IIdeaCrossSection, IIdeaObject
Inherited Members
 IIdeaCrossSection.Rotation
 IIdeaCrossSection.IsInPrincipal
 IIdeaObject.Id
 IIdeaObject.Name
Properties
 Components
Set of components.
HashSet<IIdeaCrossSectionComponent> Components { get; }
Property Value
HashSet<IIdeaCrossSectionComponent>
 Edit this page